---
kind: method
id: M:Autodesk.Revit.DB.ParameterDownloadOptions.Dispose
source: html/856b98d3-b146-4c9f-1d09-8df505044385.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.Dispose Method

Releases all resources used by the ParameterDownloadOptions

## Syntax (C#)
```csharp
public void Dispose()
```